app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.create(school_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-05-20 22:51:45.334066"], ["updated_at", "2019-05-20 22:51:45.334066"]]

  def update
    @school_class.update(school_params)
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-05-21 01:21:18.155313"], ["id", 1]]