app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-05-21 00:09:07.841979"], ["updated_at", "2019-05-21 00:09:07.841979"]]
---
    def create
        @student = Student.create(params.require(:student).permit!)

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-05-21 01:15:06.343457"], ["id", 1]]
---
    def update
        set_student
        @student.update(set_params)